armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#ifndef STORAGE_H
#define STORAGE_H


#define STORAGE_TAG "STORAGE"
// #define STORAGE_USE_HARDWARE
#define STORAGE_USE_EMULATION


// #define STORAGE_SDCARD_ENABLED 

#define STORAGE_FLOWMETER_PROFILE_ADDRESS 0
// #define STORAGE_PUBLISHER_ENABLE_ADDRESS 1
#define STORAGE_PUBLISHER_SENSOR_ADDRESS 2
//#define STORAGE_PUBLISHER_DELAY_ADDRESS 3
#define STORAGE_FIRST_RUN_INIT_ADDRESS 4 // 1 byte

#define STORAGE_FM_COUNTER_ADDRESS_1 5 // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_2 13 // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_3 21 // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_4 29  // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_5 37 // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_6 45 // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_7 53 // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_8 61  // 8 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_1 69 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_2 73 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_3 77 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_4 81 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_5 85 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_6 89 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_7 93 // 4 bytes
#define STORAGE_FM_COUNTER_ADDRESS_COUNTER_8 97 // 4 bytes

// #define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS 101 // 8 bytes
// #define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS 109 // 4 bytes



#define STORAGE_FLOWMETER_PIN_ADDRESS 117 // 1 byte

#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_1 118 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_2 122 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_3 126 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_4 130 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_5 134 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_6 138 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_7 142 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_8 146 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_1 150 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_2 154 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_3 158 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_4 162 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_5 166 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_6 170 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_7 174 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_START_ADDRESS_COUNTER_8 178 // 4 bytes

#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_1 182 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_2 186 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_3 190 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_4 194 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_5 198 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_6 202 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_7 206 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_8 210 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_1 214 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_2 218 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_3 222 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_4 226 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_5 230 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_6 234 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_7 238 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_END_ADDRESS_COUNTER_8 242 // 4 bytes

#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_1 246 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_2 254 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_3 262 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_4 270 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_5 278 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_6 286 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_7 294 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_8 302 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_1 310 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_2 314 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_3 318 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_4 322 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_5 326 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_6 330 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_7 334 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_DATA_ADDRESS_COUNTER_8 338 // 4 bytes

#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_1 342 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_2 346 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_3 350 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_4 354 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_5 358 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_6 362 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_7 366 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_8 370 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_1 374 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_2 378 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_3 382 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_4 386 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_5 390 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_6 394 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_7 398 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_ADDRESS_COUNTER_8 402 // 4 bytes

#define STORAGE_FM_ENABLED_ADDRESS_1 406 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_2 407 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_3 408 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_4 409 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_5 410 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_6 411 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_7 412 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_8 413 // 1 byte
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_1 414 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_2 418 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_3 422 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_4 426 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_5 430 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_6 434 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_7 438 // 4 bytes
#define STORAGE_FM_ENABLED_ADDRESS_COUNTER_8 442 // 4 bytes

#define STORAGE_FM_PIN_NUMBER_ADDRESS_1 446 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_2 447 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_3 448 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_4 449 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_5 450 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_6 451 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_7 452 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_8 453 // 1 byte
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_1 454 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_2 458 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_3 462 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_4 466 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_5 470 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_6 474 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_7 478 // 4 bytes
#define STORAGE_FM_PIN_NUMBER_ADDRESS_COUNTER_8 482 // 4 bytes


#define STORAGE_TIME_UTC_OFFSET_ADDRESS_1 486 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_2 488 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_3 490 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_4 492 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_5 494 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_6 496 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_7 498 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_8 500 // 2 byte
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_1 502 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_2 506 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_3 510 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_4 514 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_5 518 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_6 522 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_7 526 // 4 bytes
#define STORAGE_TIME_UTC_OFFSET_ADDRESS_COUNTER_8 530 // 4 bytes

#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_1 534 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_2 538 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_3 542 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_4 546 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_5 550 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_6 554 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_8 558 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_0 662 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_1 666 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_2 670 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_3 674 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_4 678 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_5 682 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_6 686 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_7 690 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_8 694 // 4 bytes


#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_1 698 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_2 706 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_3 714 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_4 722 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_5 730 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_6 738 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_7 746 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_8 754 // 8 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_1 762 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_2 766 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_3 770 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_4 774 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_5 778 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_6 782 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_7 786 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_DATA_ADDRESS_COUNTER_8 780 // 4 bytes

