armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_1 784 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_2 788 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_3 802 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_4 806 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_5 810 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_6 814 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_7 818 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_8 822 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_1 826 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_2 830 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_3 834 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_4 838 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_5 842 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_6 846 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_7 850 // 4 bytes
#define STORAGE_FM_COUNTER_PREVIOUS_INTERVAL_TIMESTAMP_END_ADDRESS_COUNTER_8 854 // 4 bytes


#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_1 858 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_2 866 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_3 874 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_4 882 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_5 890 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_6 898 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_7 906 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_8 914 // 8 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_1 922 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_2 926 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_3 930 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_4 934 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_5 938 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_6 942 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_7 946 // 4 bytes
#define STORAGE_FM_COUNTER_INTERVAL_TOP_DATA_ADDRESS_COUNTER_8 950 // 4 bytes

#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_1 954 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_2 956 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_3 958 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_4 960 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_5 962 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_6 964 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_7 966 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_8 968 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_1 970 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_2 974 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_3 978 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_4 982 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_5 986 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_6 990 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_7 994 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_TIME_ADDRESS_COUNTER_8 998 // 4 bytes

#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_1 1002 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_2 1004 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_3 1006 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_4 1008 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_5 1010 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_6 1012 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_7 1014 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_8 1016 // 2 byte
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_1 1018 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_2 1022 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_3 1026 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_4 1030 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_5 1034 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_6 1038 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_7 1042 // 4 bytes
#define STORAGE_FM_INTERVAL_CALCULATION_VALUE_ADDRESS_COUNTER_8 1046 // 4 bytes


#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_1 1050 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_2 1051 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_3 1052 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_4 1053 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_5 1054 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_6 1055 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_7 1056 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_8 1057 // 1 byte
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_1 1058 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_2 1062 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_3 1066 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_4 1070 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_5 1074 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_6 1078 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_7 1082 // 4 bytes
#define STORAGE_FM_CALC_ALGO_ENABLED_ADDRESS_COUNTER_8 1086 // 4 bytes

#define STORAGE_PUBLISHER_ENABLE_ADDRESS_1 1090 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_2 1094 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_3 1098 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_4 1102 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_5 1106 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_6 1110 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_7 1114 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_8 1118 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_1 1122 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_2 1126 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_3 1130 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_4 1134 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_5 1138 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_6 1142 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_7 1146 // 4 bytes
#define STORAGE_PUBLISHER_ENABLE_ADDRESS_COUNTER_8 1150 // 4 bytes

