armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#define STORAGE_PUBLISHER_DELAY_ADDRESS_1 1154 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_2 1158 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_3 1162 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_4 1166 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_5 1170 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_6 1174 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_7 1178 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_8 1182 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_1 1186 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_2 1190 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_3 1194 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_4 1198 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_5 1202 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_6 1206 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_7 1210 // 4 bytes
#define STORAGE_PUBLISHER_DELAY_ADDRESS_COUNTER_8 1214 // 4 bytes

#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_1 1218 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_2 1222 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_3 1226 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_4 1230 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_5 1234 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_6 1238 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_7 1242 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_8 1246 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_1 1250 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_2 1256 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_3 1260 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_4 1264 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_5 1268 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_6 1272 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_7 1276 // 4 bytes
#define STORAGE_PUBLISHER_NEXT_TIMESTAMP_ADDRESS_COUNTER_8 1280 // 4 bytes

#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_1 1284 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_2 1288 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_3 1292 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_4 1296 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_5 1300 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_6 1304 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_7 1308 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_8 1312 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_1 1316 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_2 1320 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_3 1324 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_4 1328 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_5 1332 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_6 1336 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_7 1340 // 4 bytes
#define STORAGE_PUBLISHER_LAST_TIMESTAMP_ADDRESS_COUNTER_8 1344 // 4 bytes



#define STORAGE_PUBLISHER_ENABLED_ADDRESS_1 1348 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_2 1349 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_3 1350 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_4 1351 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_5 1352 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_6 1353 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_7 1354 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_8 1355 // 1 byte
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_1 1356 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_2 1360 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_3 1364 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_4 1368 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_5 1372 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_6 1376 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_7 1380 // 4 bytes
#define STORAGE_PUBLISHER_ENABLED_ADDRESS_COUNTER_8 1384 // 4 bytes




// four 32 bits variables for operation settings
#define STORAGE_OPERATION_SETTINGS_ADDRESS_1 1388 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_2 1392 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_3 1396 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_4 1400 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_5 1404 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_6 1408 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_7 1412 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_8 1416 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_1 1420 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_2 1424 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_3 1428 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_4 1432 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_5 1436 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_6 1440 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_7 1444 // 4 bytes
#define STORAGE_OPERATION_SETTINGS_ADDRESS_COUNTER_8 1448 // 4 bytes

#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_1 1452 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_2 1456 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_3 1460 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_4 1464 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_5 1468 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_6 1472 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_7 1476 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_8 1480 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_1 1484 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_2 1488 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_3 1492 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_4 1496 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_5 1500 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_6 1504 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_7 1508 // 4 bytes
#define STORAGE_OPERATION_SENSOR_DATA_SETTINGS_ADDRESS_COUNTER_8 1512 // 4 bytes


#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_1 1516 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_2 1520 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_3 1524 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_4 1528 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_5 1532 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_6 1536 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_7 1540 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_8 1544 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_1 1548 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_2 1552 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_3 1556 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_4 1560 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_5 1564 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_6 1568 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_7 1572 // 4 bytes
#define STORAGE_OPERATION_NUMBERS_SETTINGS_ADDRESS_COUNTER_8 1576 // 4 bytes

#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_1 1580 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_2 1584 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_3 1588 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_4 1592 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_5 1596 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_6 1600 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_7 1604 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_8 1608 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_1 1612 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_2 1616 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_3 1620 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_4 1624 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_5 1628 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_6 1632 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_7 1636 // 4 bytes
#define STORAGE_OPERATION_TIMINGS_SETTINGS_ADDRESS_COUNTER_8 1640 // 4 bytes


