armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_1 1644 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_2 1648 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_3 1652 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_4 1656 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_5 1660 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_6 1664 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_7 1668 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_8 1672 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_1 1676 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_2 1680 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_3 1684 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_4 1688 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_5 1692 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_6 1696 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_7 1700 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_ADDRESS_COUNTER_8 1704 // 4 bytes

#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_1 1708 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_2 1712 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_3 1716 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_4 1720 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_5 1724 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_6 1728 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_7 1732 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_8 1736 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_1 1740 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_2 1744 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_3 1748 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_4 1752 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_5 1756 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_6 1760 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_7 1764 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_HIGH_VALUE_ADDRESS_COUNTER_8 1768 // 4 bytes

#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_1 1772 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_2 1776 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_3 1780 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_4 1784 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_5 1788 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_6 1792 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_7 1796 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_8 1800 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_1 1804 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_2 1808 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_3 1812 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_4 1816 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_5 1820 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_6 1824 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_7 1828 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_LOW_VALUE_ADDRESS_COUNTER_8 1832 // 4 bytes

#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_1 1836 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_2 1840 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_3 1844 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_4 1848 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_5 1852 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_6 1856 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_7 1860 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_8 1864 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_1 1868 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_2 1872 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_3 1876 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_4 1880 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_5 1884 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_6 1888 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_7 1892 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_VARIANCE_ADDRESS_COUNTER_8 1896 // 4 bytes

#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_1 1900 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_2 1904 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_3 1908 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_4 1912 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_5 1916 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_6 1920 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_7 1924 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_8 1928 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_1 1932 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_2 1936 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_3 1940 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_4 1944 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_5 1948 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_6 1952 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_7 1956 // 4 bytes
#define STORAGE_AMBIENT_LIGHT_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_8 1960 // 4 bytes

