armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_1 1964 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_2 1968 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_3 1972 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_4 1976 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_5 1980 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_6 1984 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_7 1988 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_8 1992 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_1 1996 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_2 2000 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_3 2004 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_4 2008 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_5 2012 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_6 2016 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_7 2020 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_ADDRESS_COUNTER_8 2024 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_1 2028 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_2 2032 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_3 2036 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_4 2040 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_5 2044 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_6 2048 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_7 2052 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_8 2056 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_1 2060 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_2 2064 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_3 2068 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_4 2072 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_5 2076 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_6 2080 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_7 2084 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_HIGH_ADDRESS_COUNTER_8 2088 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_1 2092 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_2 2096 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_3 2100 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_4 2104 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_5 2108 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_6 2112 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_7 2116 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_8 2120 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_1 2124 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_2 2128 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_3 2132 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_4 2136 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_5 2140 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_6 2144 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_7 2148 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_TEMPERATURE_LOW_ADDRESS_COUNTER_8 2152 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_1 2156 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_2 2160 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_3 2164 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_4 2168 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_5 2172 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_6 2176 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_7 2180 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_8 2184 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_1 2188 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_2 2192 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_3 2196 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_4 2200 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_5 2204 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_6 2208 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_7 2212 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_HIGH_ADDRESS_COUNTER_8 2216 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_1 2220 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_2 2224 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_3 2228 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_4 2232 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_5 2236 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_6 2240 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_7 2244 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_8 2248 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_1 2252 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_2 2256 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_3 2260 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_4 2264 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_5 2268 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_6 2272 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_7 2276 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_HUMIDITY_LOW_ADDRESS_COUNTER_8 2280 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_1 2284 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_2 2288 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_3 2292 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_4 2296 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_5 2300 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_6 2304 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_7 2308 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_8 2312 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_1 2316 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_2 2320 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_3 2324 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_4 2328 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_5 2332 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_6 2336 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_7 2340 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_PERSISTENCE_ADDRESS_COUNTER_8 2344 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_1 2348 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_2 2352 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_3 2356 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_4 2360 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_5 2364 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_6 2368 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_7 2372 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_8 2376 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_1 2380 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_2 2384 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_3 2388 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_4 2392 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_5 2396 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_6 2400 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_7 2404 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_VARIANCE_ADDRESS_COUNTER_8 2408 // 4 bytes

#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_1 2412 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_2 2416 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_3 2420 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_4 2424 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_5 2428 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_6 2432 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_7 2436 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_8 2440 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_1 2444 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_2 2448 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_3 2452 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_4 2456 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_5 2460 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_6 2464 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_7 2468 // 4 bytes
#define STORAGE_TEMPERATURE_HUMDITY_SETTINGS_MEASUREMENT_ADDRESS_COUNTER_8 2472 // 4 bytes


