armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_1 2476 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_2 2480 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_3 2484 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_4 2488 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_5 2492 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_6 2496 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_7 2500 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_8 2504 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_1 2508 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_2 2512 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_3 2516 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_4 2520 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_5 2524 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_6 2528 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_7 2532 // 4 bytes
#define STORAGE_INERTIAL_SETTINGS_ADDRESS_COUNTER_8 2536 // 4 bytes

#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_1 2540 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_2 2544 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_3 2548 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_4 2552 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_5 2556 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_6 2560 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_7 2564 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_8 2568 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_1 2572 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_2 2576 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_3 2580 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_4 2584 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_5 2588 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_6 2592 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_7 2596 // 4 bytes
#define STORAGE_INERTIAL_ACCELEROMETER_SETTINGS_ADDRESS_COUNTER_8 2600 // 4 bytes

#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_1 2604 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_2 2608 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_3 2612 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_4 2616 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_5 2620 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_6 2624 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_7 2628 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_8 2632 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_1 2636 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_2 2640 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_3 2644 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_4 2648 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_5 2652 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_6 2656 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_7 2660 // 4 bytes
#define STORAGE_INERTIAL_GYRO_SETTINGS_ADDRESS_COUNTER_8 2664 // 4 bytes

#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_1 2668 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_2 2672 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_3 2676 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_4 2680 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_5 2684 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_6 2688 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_7 2692 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_8 2696 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_1 2700 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_2 2704 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_3 2708 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_4 2712 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_5 2716 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_6 2720 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_7 2724 // 4 bytes
#define STORAGE_INERTIAL_TEMPERATURE_SETTINGS_ADDRESS_COUNTER_8 2728 // 4 bytes

#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_1 2732 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_2 2736 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_3 2740 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_4 2744 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_5 2748 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_6 2752 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_7 2756 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_8 2760 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_1 2764 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_2 2768 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_3 2772 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_4 2776 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_5 2780 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_6 2784 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_7 2788 // 4 bytes
#define STORAGE_INERTIAL_INTERRUPT_SETTINGS_ADDRESS_COUNTER_8 2792 // 4 bytes

#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_1 2796 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_2 2800 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_3 2804 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_4 2808 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_5 2812 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_6 2816 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_7 2820 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_8 2824 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_1 2828 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_2 2832 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_3 2836 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_4 2840 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_5 2844 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_6 2848 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_7 2852 // 4 bytes
#define STORAGE_INERTIAL_STEP_COUNTER_SETTINGS_ADDRESS_COUNTER_8 2856 // 4 bytes

#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_1 2860 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_2 2864 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_3 2868 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_4 2872 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_5 2876 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_6 2880 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_7 2884 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_8 2888 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_1 2892 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_2 2896 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_3 2900 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_4 2904 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_5 2908 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_6 2912 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_7 2916 // 4 bytes
#define STORAGE_INERTIAL_STATE_MACHINE_SETTINGS_ADDRESS_COUNTER_8 2920 // 4 bytes

