armx40/rp2040-3rd-stage-bootloader/bootloader/headers/storage.h
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_1 2924 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_2 2928 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_3 2932 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_4 2936 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_5 2940 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_6 2944 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_7 2948 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_8 2952 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_1 2956 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_2 2960 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_3 2964 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_4 2968 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_5 2972 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_6 2976 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_7 2980 // 4 bytes
#define STORAGE_INERTIAL_FREEFALL_SETTINGS_ADDRESS_COUNTER_8 2984 // 4 bytes

#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_1 2988 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_2 2992 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_3 2996 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_4 3000 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_5 3004 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_6 3008 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_7 3012 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_8 3016 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_1 3020 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_2 3024 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_3 3028 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_4 3032 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_5 3036 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_6 3040 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_7 3044 // 4 bytes
#define STORAGE_INERTIAL_SENSORHUB_SETTINGS_ADDRESS_COUNTER_8 3048 // 4 bytes




#define STORAGE_GNSS_SETTINGS_ADDRESS_1 3052 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_2 3056 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_3 3060 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_4 3064 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_5 3068 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_6 3072 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_7 3076 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_8 3080 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_1 3084 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_2 3088 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_3 3092 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_4 3096 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_5 3100 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_6 3104 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_7 3108 // 4 bytes
#define STORAGE_GNSS_SETTINGS_ADDRESS_COUNTER_8 3112 // 4 bytes

#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_1 3116 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_2 3120 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_3 3124 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_4 3128 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_5 3132 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_6 3136 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_7 3140 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_8 3144 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_1 3148 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_2 3152 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_3 3156 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_4 3160 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_5 3164 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_6 3168 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_7 3172 // 4 bytes
#define STORAGE_GNSS_INTERRUPT_SETTINGS_ADDRESS_COUNTER_8 3176 // 4 bytes

#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_1 3180 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_2 3184 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_3 3188 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_4 3192 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_5 3196 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_6 3200 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_7 3204 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_8 3208 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_1 3212 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_2 3216 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_3 3220 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_4 3224 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_5 3228 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_6 3232 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_7 3236 // 4 bytes
#define STORAGE_GNSS_GEO_SETTINGS_ADDRESS_COUNTER_8 3240 // 4 bytes

#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_1 3244 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_2 3248 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_3 3252 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_4 3256 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_5 3260 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_6 3264 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_7 3268 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_8 3272 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_1 3276 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_2 3280 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_3 3284 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_4 3288 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_5 3292 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_6 3296 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_7 3300 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_1_ADDRESS_COUNTER_8 3304 // 4 bytes

#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_1 3308 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_2 3312 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_3 3316 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_4 3320 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_5 3324 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_6 3328 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_7 3332 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_8 3336 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_1 3340 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_2 3344 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_3 3348 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_4 3352 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_5 3356 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_6 3360 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_7 3364 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_2_ADDRESS_COUNTER_8 3368 // 4 bytes

#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_1 3372 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_2 3376 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_3 3380 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_4 3384 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_5 3388 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_6 3392 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_7 3396 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_8 3400 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_1 3404 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_2 3408 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_3 3412 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_4 3416 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_5 3420 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_6 3424 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_7 3428 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_3_ADDRESS_COUNTER_8 3432 // 4 bytes

#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_1 3436 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_2 3440 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_3 3444 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_4 3448 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_5 3452 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_6 3456 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_7 3460 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_8 3464 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_1 3468 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_2 3472 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_3 3476 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_4 3480 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_5 3484 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_6 3488 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_7 3492 // 4 bytes
#define STORAGE_GNSS_GEO_POINT_4_ADDRESS_COUNTER_8 3496 // 4 bytes

int storage_write_zeroes();
int storage_init();

int storage_write_u8(uint32_t addr, uint8_t val);
int storage_write_u16(uint32_t addr, uint16_t val);
int storage_write_u32(uint32_t addr, uint32_t val);
int storage_write_u64(uint32_t addr, uint64_t val);
int storage_read_u8(uint32_t addr, uint8_t *val);
int storage_read_u16(uint32_t addr, uint16_t *val);
int storage_read_u32(uint32_t addr, uint32_t *val);
int storage_read_u64(uint32_t addr, uint64_t *val);
int storage_write_block(uint32_t addr, uint8_t *data, uint32_t data_size);
int storage_read_block(uint32_t addr, uint8_t *buff, uint32_t buff_size);

int storage_counter_write_u8(uint32_t addr, uint32_t counter_addr, uint8_t val);
int storage_counter_write_u16(uint32_t addr, uint32_t counter_addr, uint16_t val);
int storage_counter_write_u32(uint32_t addr, uint32_t counter_addr, uint32_t val);
int storage_counter_write_u64(uint32_t addr, uint32_t counter_addr, uint64_t val);
int storage_counter_read_u8(uint32_t addr, uint32_t counter_addr, uint8_t *val);
int storage_counter_read_u16(uint32_t addr, uint32_t counter_addr, uint16_t *val);
int storage_counter_read_u32(uint32_t addr, uint32_t counter_addr, uint32_t *val);
int storage_counter_read_u64(uint32_t addr, uint32_t counter_addr, uint64_t *val);

#endif